Revit 2022 API
AnalyticalModelStick.SetProjection Method
Overload List
Name | Description
SetProjection(AnalyticalElementSelector, ElementId, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, ElementId, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
See Also
AnalyticalModelStick Class
AnalyticalModelStick Members
Autodesk.Revit.DB.Structure Namespace